app/views/user_logs/index.html.erb

SELECT "logs".* FROM "logs" INNER JOIN "lots" ON "logs"."lot_id" = "lots"."id" WHERE "lots"."user_id" = $1 ORDER BY "logs"."created_at" DESC  [["user_id", 1]]
---
      <tbody>
        <% Current.user.logs.order(created_at: :desc).each do |log| %>