app/views/user_logs/new.html.erb

      <tbody>
        <% Current.user.logs.todays_logs.each do |log| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "logs".* FROM "logs" INNER JOIN "lots" ON "logs"."lot_id" = "lots"."id" WHERE "lots"."user_id" = $1 AND "logs"."created_at" BETWEEN $2 AND $3  [["user_id", 1], ["created_at", "2023-07-15 00:00:00"], ["created_at", "2023-07-15 23:59:59.999999"]]

  <div class="mb-3">
    <%= form.select :lot, Current.user.lots.current_lots_names, required: true %>
---
SELECT "lots".* FROM "lots" WHERE "lots"."user_id" = $1 AND (lots.status = 2) AND (lots.current_amount > 0)  [["user_id", 1]]

<h2>Lots available</h2>
<% Current.user.lots.current_available_lots.each do |lot| %>
---
SELECT "lots".* FROM "lots" WHERE "lots"."user_id" = $1 AND (lots.status = 2) AND (lots.current_amount > 0)  [["user_id", 1]]