app/views/user_lots/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "lots".* FROM "lots" WHERE "lots"."user_id" = $1 AND (lots.status = 2 or lots.status = 1)  [["user_id", 1]]
---
      <tbody>
        <% Current.user.lots.ordered_or_arrived_lots.each do |lot| %>