app/views/blends/index.html.erb

SELECT "blends".* FROM "blends" WHERE "blends"."user_id" = $1 ORDER BY "blends"."created_at" DESC  [["user_id", 1]]
---
      <tbody>
        <% Current.user.blends.order(created_at: :desc).each do |blend| %>