app/views/blends/new.html.erb

      <tbody>
        <% Current.user.blends.todays_blends.each do |blend| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "blends".* FROM "blends" WHERE "blends"."user_id" = $1 AND "blends"."created_at" BETWEEN $2 AND $3  [["user_id", 1], ["created_at", "2023-07-15 00:00:00"], ["created_at", "2023-07-15 23:59:59.999999"]]

  <%= form.label :logs %>
  <%= form.select :logs, Current.user.logs.todays_logs.where.not(id: BlendLog.pluck(:log_id)).order(created_at: :desc).pluck(:name, :id), {}, multiple: true, class: "form-control" %>
---
SELECT "name", "logs"."id" FROM "logs" INNER JOIN "lots" ON "logs"."lot_id" = "lots"."id" WHERE "lots"."user_id" = $1 AND "logs"."created_at" BETWEEN $2 AND $3 ORDER BY "logs"."created_at" DESC  [["user_id", 1], ["created_at", "2023-07-15 00:00:00"], ["created_at", "2023-07-15 23:59:59.999999"]]