app/controllers/blends_controller.rb

  def create


    @blend = Blend.new(blend_params)
    @blend.user_id = Current.user.id

   @blend.save

   blend_log_params =  params[:blend][:logs].drop(1)

   blend_log_params.each do |log|
      @blend_log = BlendLog.new()
      @blend_log.blend_id = @blend.id
      @blend_log.log_id = log.to_i

      @blend_log.save
---
INSERT INTO "blends" ("name", "notes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Should remove"], ["notes", "This should remove Guat from list"], ["user_id", 1], ["created_at", "2023-07-15 18:41:19.044816"], ["updated_at", "2023-07-15 18:41:19.044816"]]
INSERT INTO "blend_logs" ("blend_id", "log_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["blend_id", 12], ["log_id", 9], ["created_at", "2023-07-15 18:41:19.099971"], ["updated_at", "2023-07-15 18:41:19.099971"]]

    def set_blend
      @blend = Blend.find(params[:id])
---
SELECT  "blends".* FROM "blends" WHERE "blends"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]