app/controllers/user_logs_controller.rb

  def create
    if params[:log][:lot]
      log = Log.new(log_params)
      log.total_roasted = log.batches * log.batch_size_kg
      lot = Lot.find_by(name: params[:log][:lot])
      lot.current_amount = lot.current_amount - log.total_roasted
      lot.save
      log.lot_id = lot.id
      if log.save
---
SELECT  "lots".* FROM "lots" WHERE "lots"."name" = $1 LIMIT $2  [["name", "Example1"], ["LIMIT", 1]]
UPDATE "lots" SET "current_amount" = $1, "updated_at" = $2 WHERE "lots"."id" = $3  [["current_amount", 29.0], ["updated_at", "2023-07-15 18:40:01.563519"], ["id", 1]]
INSERT INTO "logs" ("batches", "batch_size_kg", "lot_id", "created_at", "updated_at", "total_roasted") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["batches", 1], ["batch_size_kg", 8.0], ["lot_id", 1], ["created_at", "2023-07-15 18:40:01.574825"], ["updated_at", "2023-07-15 18:40:01.574825"], ["total_roasted", 8.0]]

  def weight_out
    log = Log.find(params[:log_id])
    log.weight_out = params[:weight_out]
    log.moisture_loss = 1 - (params[:weight_out].to_f/log.batch_size_kg)
    log.save
---
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "logs" SET "weight_out" = $1, "moisture_loss" = $2, "updated_at" = $3 WHERE "logs"."id" = $4  [["weight_out", 7.0], ["moisture_loss", 0.125], ["updated_at", "2023-07-15 18:39:30.638501"], ["id", 4]]