app/models/lot.rb

  def self.to_csv
    attributes = %w[id status name pcc_id sku importer description price_per us_arrival sample_roasted_date density moisture bean_size item_size quantity_recieved kg_received current_amount invoice_number user_id created_at updated_at ico]

    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |lot|
        csv << attributes.map { |attr| lot.send(attr) }
---
SELECT "lots".* FROM "lots" WHERE "lots"."user_id" = $1  [["user_id", 1]]